Added  README with  architecture diagram
